In [1]:
import pandas as pd

df = pd.read_csv(r'C:\Users\rajat.prakash\Desktop\Remote_repo\Data\Data_Analysis\Files\Uber Drives 2016.csv')

In [3]:
df.head(2)

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
0,1/1/2016 21:11,1/1/2016 21:17,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain
1,1/2/2016 1:25,1/2/2016 1:37,Business,Fort Pierce,Fort Pierce,5.0,NaN

In [7]:
df.groupby('START_DATE*')['END_DATE*','MILES*'].max()

                       END_DATE*  MILES*
START_DATE*
1/1/2016 21:11    1/1/2016 21:17     5.1
1/10/2016 12:17  1/10/2016 12:44    16.5
1/10/2016 15:08  1/10/2016 15:51    10.8
1/10/2016 18:18  1/10/2016 18:53     7.5
1/10/2016 19:12  1/10/2016 19:32     6.2
...                          ...     ...
9/29/2016 16:13  9/29/2016 18:47    12.6
9/30/2016 17:39  9/30/2016 20:20    37.7
9/30/2016 20:59  9/30/2016 22:34    16.7
9/5/2016 10:25    9/5/2016 10:44    17.2
9/6/2016 17:49    9/6/2016 17:49    69.1

[1154 rows x 2 columns]

In [10]:
df.columns
df.dtypes

START_DATE*     object
END_DATE*       object
CATEGORY*       object
START*          object
STOP*           object
MILES*         float64
PURPOSE*        object
dtype: object

In [12]:
df['START_DATE*'] = pd.to_datetime(df['START_DATE*'])
df['END_DATE*'] = pd.to_datetime(df['END_DATE*'])
df.dtypes

START_DATE*    datetime64[ns]
END_DATE*      datetime64[ns]
CATEGORY*              object
START*                 object
STOP*                  object
MILES*                float64
PURPOSE*               object
dtype: object

In [17]:
print(df.dtypes)
data = df.loc[df['START_DATE*']>'2016-12-31']
data

START_DATE*    datetime64[ns]
END_DATE*      datetime64[ns]
CATEGORY*              object
START*                 object
STOP*                  object
MILES*                float64
PURPOSE*               object
dtype: object

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
1150,2016-12-31 01:07:00,2016-12-31 01:14:00,Business,Kar?chi,Kar?chi,0.7,Meeting
1151,2016-12-31 13:24:00,2016-12-31 13:42:00,Business,Kar?chi,Unknown Location,3.9,Temporary Site
1152,2016-12-31 15:03:00,2016-12-31 15:38:00,Business,Unknown Location,Unknown Location,16.2,Meeting
1153,2016-12-31 21:32:00,2016-12-31 21:50:00,Business,Katunayake,Gampaha,6.4,Temporary Site
1154,2016-12-31 22:08:00,2016-12-31 23:51:00,Business,Gampaha,Ilukwatta,48.2,Temporary Site

In [28]:
new = df.groupby('START*').agg({'MILES*':'mean','START_DATE*':['min','max']})
new.reset_index(inplace=True)
new.columns = ['START_CITY*','AVG_DISTANCE*','FIRST_TRIP*','LAST_TRIP*']
new

         START_CITY*  AVG_DISTANCE*         FIRST_TRIP*          LAST_TRIP*
0              Agnew       2.775000 2016-11-04 21:04:00 2016-11-06 10:50:00
1             Almond      15.200000 2016-10-30 12:58:00 2016-10-30 12:58:00
2               Apex       5.341176 2016-01-29 21:21:00 2016-12-12 14:26:00
3              Arabi      17.000000 2016-06-25 10:50:00 2016-06-25 10:50:00
4          Arlington       4.900000 2016-08-02 11:51:00 2016-08-02 11:51:00
..               ...            ...                 ...                 ...
172  West University       2.200000 2016-03-10 14:39:00 2016-03-16 18:43:00
173           Weston       4.000000 2016-03-05 12:57:00 2016-06-05 15:57:00
174   Westpark Place       2.182353 2016-02-26 11:05:00 2016-11-03 14:13:00
175      Whitebridge       4.020588 2016-01-19 09:09:00 2016-11-03 13:42:00
176    Winston Salem     133.600000 2016-10-28 18:13:00 2016-10-28 18:13:00

[177 rows x 4 columns]

In [29]:
df.dtypes

START_DATE*    datetime64[ns]
END_DATE*      datetime64[ns]
CATEGORY*              object
START*                 object
STOP*                  object
MILES*                float64
PURPOSE*               object
dtype: object